In [113]:
import numpy as np, pandas as pd

In [151]:
rs = np.random.RandomState(1234)
data1 = pd.DataFrame(rs.randint(0,49,[6,8]))
data1.columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight']
data1.index = ['A', 'B', 'C', 'D', 'E', 'F']
data1

   One  Two  Three  Four  Five  Six  Seven  Eight
A   47   19     38    12    24   15     23     41
B   26   30     43    30    44   26     48     28
C    5   16      9    47    48   12     37     34
D   38    3     39    11     0   41     11     16
E    3    2     19    12     1   11     43     17
F   14    7     42    43    46   28     17     23

In [153]:
data1['IQR']= data1.quantile(0.75, axis=1) - data1.quantile(0.25, axis=1) # Calculating difference (range) between 3rd(0.75) and 1st(0.25) quantile, for each row
data1

   One  Two  Three  Four  Five  Six  Seven  Eight   IQR
A   47   19     38    12    24   15     23     41  19.0
B   26   30     43    30    44   26     48     28  17.0
C    5   16      9    47    48   12     37     34  25.0
D   38    3     39    11     0   41     11     16  27.0
E    3    2     19    12     1   11     43     17  14.0
F   14    7     42    43    46   28     17     23  25.0

In [154]:
data1.T.describe() #Reference for checking to IQR and CV result

               A          B          C          D          E          F
count   9.000000   9.000000   9.000000   9.000000   9.000000   9.000000
mean   26.444444  32.444444  25.888889  20.666667  13.555556  27.222222
std    12.430920  10.248306  16.343534  15.960890  12.846314  13.836345
min    12.000000  17.000000   5.000000   0.000000   1.000000   7.000000
25%    19.000000  26.000000  12.000000  11.000000   3.000000  17.000000
50%    23.000000  30.000000  25.000000  16.000000  12.000000  25.000000
75%    38.000000  43.000000  37.000000  38.000000  17.000000  42.000000
max    47.000000  48.000000  48.000000  41.000000  43.000000  46.000000

In [166]:
data1['CV'] = data1.std(axis=1) / data1.mean(axis=1) #Calculating CV
data1

   One  Two  Three  Four  Five  Six  Seven  Eight   IQR        CV
A   47   19     38    12    24   15     23     41  19.0  0.598845
B   26   30     43    30    44   26     48     28  17.0  0.478110
C    5   16      9    47    48   12     37     34  25.0  0.741837
D   38    3     39    11     0   41     11     16  27.0  0.872150
E    3    2     19    12     1   11     43     17  14.0  1.035659
F   14    7     42    43    46   28     17     23  25.0  0.631849